// src/i18n.js
import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';
import LanguageDetector from 'i18next-browser-languagedetector';

const resources = {
    en: {
        translation: {
            "ВТУ": "VTU",
            "Центрове": "Centers",
            "Прием": "Admission",
            "Студенти": "Students",
            "Научна дейност": "Research",
            "Международна дейност": "International Activities",
            "Кариери и завършили": "Careers and Alumni",
            "Контакти": "Contacts",
            'Великотърновски университет "Св. св. Кирил и Методий"':'Veliko Tarnovo University "St. Cyril and Methodius"',
            'E-преподавател': 'E-teacher',
            'Е-студент': 'E-student',
            'Вход': 'Login',
            'Търсене': 'Search',
            'Всички': 'All',
            'Новини и събития': 'News and events',
            'Преподаватели и служители': 'Teachers and staff',
            'Страници': 'Pages',
            'Бакалавърски програми': 'Bachelor\'s programs',
            'Магистърски програми': 'Master\'s programs',
            'Докторски програми': 'Ph.d\'s programs',
            'Дистанционно обучение': 'Distance learning',
            "Ръководство": "Leadership",
            "Акредитации и сертификати": "Accreditations and Certificates",
            "Програма Еразъм+": "Erasmus+ Program",
            "Политики и декларации": "Policies and Declarations",
            "Електронни услуги": "Electronic Services",
            "Електронно обучение": "E-Learning",
            "Университетска библиотека": "University Library",
            "Кариерен център": "Career Center",
            "Инструкция за достъп": "Access Instructions",
            "Студентско кредитиране": "Student Loans",
            "Студентски стипендии": "Student Scholarships",
            "Студентски живот": "Student Life",
            "Учебен отдел": "Academic Department",
            "Научни издания": "Scientific Publications",
            "Проекти": "Projects",
            "Научна е-библиотека": "Scientific E-Library",
            "Конкурси": "Competitions",
            "Е-преподавател": "E-Teacher",
            "За Университета": "About the University",
            "Информационни Ресурси": "Information Resources",
            "Преподаватели": "Faculty",
            "Новини": "News",
            "Китайска делегация посети Великотърновския университет": "Chinese delegation visited Veliko Tarnovo University",
            "Международен летен семинар по български език и култура": "International summer seminar on Bulgarian language and culture",
            "ПРИЕМ МАГИСТЪР 2024 г.": "MA Admission 2024",
            "Придобиване на ПКС във Великотърновския университет": "Acquiring a PhD at Veliko Tarnovo University",

            "Събития": "Events",
            "НАЧАЛО": "START",
            "ЮНИ": "JUNE",
            "КРАЙ": "END",
            "Академия по предприемачество в земеделието": "Academy of Entrepreneurship in Agriculture",
            "25 ЮНИ 2024 - 28 ЮНИ 2024": "25 June 2024 - 28 June 2024",
            "ВЕЛИКОТЪРНОВСКИ УНИВЕРСИТЕТ -  \"СВ. СВ. КИРИЛ И МЕТОДИЙ\"": "University of Veliko Tarnovo - \"St. Cyril and Methodius\"",
            "Първото издание ще се проведе от 25 до 28 юни 2024 година - град Велико Търново във Великотърноски университет - \"Св. св. Кирил и Методий\"": "The first edition will take place from June 25 to June 28, 2024 in Veliko Tarnovo at the University \"St. Cyril and Methodius\"",
            "Публична защита на дисертационен труд": "Public Defense of Dissertation",
            "ЮЛИ": "July",
            "ЗАЛА": "ROOM ",
            "ОКТ": "OCT",
            "Конференция на тема Правото и бизнесът в съвременното общество": "Conference on Law and Business in Modern Society",
            "Виж всички": "View All"

        }
    },
    bg: {
        translation: {
            "ВТУ": "ВТУ",
            "Центрове": "Центрове",
            "Прием": "Прием",
            "Студенти": "Студенти",
            "Научна дейност": "Научна дейност",
            "Международна дейност": "Международна дейност",
            "Кариери и завършили": "Кариери и завършили",
            "Контакти": "Контакти",
            'Великотърновски университет "Св. св. Кирил и Методий"': 'Великотърновски университет "Св. св. Кирил и Методий"',
            'E-преподавател': 'E-преподавател',
            'Е-студент': 'Е-студент',
            'Вход': 'Вход',
            'Търсене': 'Търсене',
            'Всички': 'Всички',
            'Новини и събития': 'Новини и събития',
            'Страници': 'Страници',
            'Бакалавърски програми': 'Бакалавърски програми',
            'Магистърски програми': 'Магистърски програми',
            'Докторски програми': 'Докторски програми',
            'Дистанционно обучение': 'Дистанционно обучение',
            "Ръководство": "Ръководство",
            "Акредитации и сертификати": "Акредитации и сертификати",
            "Програма Еразъм+": "Програма Еразъм+",
            "Политики и декларации": "Политики и декларации",
            "Електронни услуги": "Електронни услуги",
            "Електронно обучение": "Електронно обучение",
            "Университетска библиотека": "Университетска библиотека",
            "Кариерен център": "Кариерен център",
            "Инструкция за достъп": "Инструкция за достъп",
            "Студентско кредитиране": "Студентско кредитиране",
            "Студентски стипендии": "Студентски стипендии",
            "Студентски живот": "Студентски живот",
            "Учебен отдел": "Учебен отдел",
            "Научни издания": "Научни издания",
            "Проекти": "Проекти",
            "Научна е-библиотека": "Научна е-библиотека",
            "Конкурси": "Конкурси",
            "Е-преподавател": "Е-преподавател",
            "За Университета": "За Университета",
            "Информационни Ресурси": "Информационни Ресурси",
            "Преподаватели": "Преподаватели",
            "Новини": "Новини",
            "Китайска делегация посети Великотърновския университет": "Китайска делегация посети Великотърновския университет",
            "Международен летен семинар по български език и култура": "Международен летен семинар по български език и култура",
            "ПРИЕМ МАГИСТЪР 2024 г.": "ПРИЕМ МАГИСТЪР 2024 г.",
            "Придобиване на ПКС във Великотърновския университет": "Придобиване на ПКС във Великотърновския университет",

            "Събития": "Събития",
            "НАЧАЛО": "НАЧАЛО",
            "ЮНИ": "ЮНИ",
            "КРАЙ": "КРАЙ",
            "Академия по предприемачество в земеделието": "Академия по предприемачество в земеделието",
            "ВЕЛИКОТЪРНОВСКИ УНИВЕРСИТЕТ -  \"СВ. СВ. КИРИЛ И МЕТОДИЙ\"": "ВЕЛИКОТЪРНОВСКИ УНИВЕРСИТЕТ -  \"СВ. СВ. КИРИЛ И МЕТОДИЙ\"",
            "Първото издание ще се проведе от 25 до 28 юни 2024 година - град Велико Търново във Великотърноски университет - \"Св. св. Кирил и Методий\"": "Първото издание ще се проведе от 25 до 28 юни 2024 година - град Велико Търново във Великотърноски университет - \"Св. св. Кирил и Методий\"",
            "Публична защита на дисертационен труд": "Публична защита на дисертационен труд",
            "ЮЛИ": "ЮЛИ",
            "ОКТ": "ОКТ",
            "ЗАЛА": "ЗАЛА",
            "Конференция на тема Правото и бизнесът в съвременното общество": "Конференция на тема Правото и бизнесът в съвременното общество",
            "Виж всички": "Виж всички"



        }
    }
};

i18n
    .use(LanguageDetector) // detects the user language
    .use(initReactI18next) // passes i18n down to react-i18next
    .init({
        resources,
        fallbackLng: 'en',
        interpolation: {
            escapeValue: false // react already safes from xss
        }
    });

export default i18n;
