// src/i18n.js
import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';
import LanguageDetector from 'i18next-browser-languagedetector';

const resources = {
    en: {
        translation: {
            "ВТУ": "VTU",
            "Центрове": "Centers",
            "Прием": "Admission",
            "Студенти": "Students",
            "Научна дейност": "Research",
            "Международна дейност": "International Activities",
            "Кариери и завършили": "Careers and Alumni",
            "Контакти": "Contacts",
            'Великотърновски университет "Св. св. Кирил и Методий"':'Veliko Tarnovo University "St. st. Cyril and Methodius"',
            'E-преподавател': 'E-teacher',
            'Е-студент': 'E-student',
            'Вход': 'Login',
            'Търсене': 'Search',
            'Всички': 'All',
            'Новини и събития': 'News and events',
            'Преподаватели и служители': 'Teachers and staff',
            'Страници': 'Pages',
            'Бакалавърски програми': 'Bachelor\'s programs',
            'Магистърски програми': 'Master\'s programs',
            'Докторски програми': 'Ph.d\'s programs',
            'Дистанционно обучение': 'Distance learning',
            "Ръководство": "Leadership",
            "Акредитации и сертификати": "Accreditations and Certificates",
            "Програма Еразъм+": "Erasmus+ Program",
            "Политики и декларации": "Policies and Declarations",
            "Електронни услуги": "Electronic Services",
            "Електронно обучение": "E-Learning",
            "Университетска библиотека": "University Library",
            "Кариерен център": "Career Center",
            "Инструкция за достъп": "Access Instructions",
            "Студентско кредитиране": "Student Loans",
            "Студентски стипендии": "Student Scholarships",
            "Студентски живот": "Student Life",
            "Учебен отдел": "Academic Department",
            "Научни издания": "Scientific Publications",
            "Проекти": "Projects",
            "Научна е-библиотека": "Scientific E-Library",
            "Конкурси": "Competitions",
            "Е-преподавател": "E-Teacher",
            "За Университета": "About the University",
            "Информационни Ресурси": "Information Resources",
            "Преподаватели": "Faculty",

        }
    },
    bg: {
        translation: {
            "ВТУ": "ВТУ",
            "Центрове": "Центрове",
            "Прием": "Прием",
            "Студенти": "Студенти",
            "Научна дейност": "Научна дейност",
            "Международна дейност": "Международна дейност",
            "Кариери и завършили": "Кариери и завършили",
            "Контакти": "Контакти",
            'Великотърновски университет "Св. св. Кирил и Методий"': 'Великотърновски университет "Св. св. Кирил и Методий"',
            'E-преподавател': 'E-преподавател',
            'Е-студент': 'Е-студент',
            'Вход': 'Вход',
            'Търсене': 'Търсене',
            'Всички': 'Всички',
            'Новини и събития': 'Новини и събития',
            'Страници': 'Страници',
            'Бакалавърски програми': 'Бакалавърски програми',
            'Магистърски програми': 'Магистърски програми',
            'Докторски програми': 'Докторски програми',
            'Дистанционно обучение': 'Дистанционно обучение',
            "Ръководство": "Ръководство",
            "Акредитации и сертификати": "Акредитации и сертификати",
            "Програма Еразъм+": "Програма Еразъм+",
            "Политики и декларации": "Политики и декларации",
            "Електронни услуги": "Електронни услуги",
            "Електронно обучение": "Електронно обучение",
            "Университетска библиотека": "Университетска библиотека",
            "Кариерен център": "Кариерен център",
            "Инструкция за достъп": "Инструкция за достъп",
            "Студентско кредитиране": "Студентско кредитиране",
            "Студентски стипендии": "Студентски стипендии",
            "Студентски живот": "Студентски живот",
            "Учебен отдел": "Учебен отдел",
            "Научни издания": "Научни издания",
            "Проекти": "Проекти",
            "Научна е-библиотека": "Научна е-библиотека",
            "Конкурси": "Конкурси",
            "Е-преподавател": "Е-преподавател",
            "За Университета": "За Университета",
            "Информационни Ресурси": "Информационни Ресурси",
            "Преподаватели": "Преподаватели",

        }
    }
};

i18n
    .use(LanguageDetector) // detects the user language
    .use(initReactI18next) // passes i18n down to react-i18next
    .init({
        resources,
        fallbackLng: 'en',
        interpolation: {
            escapeValue: false // react already safes from xss
        }
    });

export default i18n;
